FV2304/E_0102.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">MaBiS</FONT></B><BR align="left"/><BR/><B><FONT POINT-SIZE="16">7.8.1: AD: Zuordnung einer Netzgangzeitreihe zu einer Netzzeitreihe beim NB</FONT></B><BR align="left"/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    "Start" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7a8da1", label=<<B>E_0102</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> NB</B></FONT><BR align="center"/>>];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>1: </B>Wird die ID der Netzgangzeitreihe bereits für die Identifikation eines<BR align="left"/>Nicht-MaBiS-ZP verwendet?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A01</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>ID bereits außerhalb MaBiS verwendet<BR align="left"/></FONT>>];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>2: </B>Entspricht die Zuordnung der Netzgangzeitreihe zur Netzzeitreihe der<BR align="left"/>Vereinbarung zur messtechnischen Abgrenzung der beiden benachbarten NB?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A02</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Zuordnung passt nicht zur Vereinbarung<BR align="left"/></FONT>>];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>3: </B>Ist der Absender zum Zuordnungsbeginn an der Netzzeitreihe beteiligt?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A03</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Keine Berechtigung für die Netzzeitreihe<BR align="left"/></FONT>>];
    "4" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>4: </B>Ist der Empfänger zum Zuordnungsbeginn an der Netzzeitreihe beteiligt?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A04</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Keine Beteiligung an der Netzzeitreihe<BR align="left"/></FONT>>];
    "5" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>5: </B>Existiert zum Zuordnungsbeginn bereits eine Zuordnung der angegebenen<BR align="left"/>Netzgangzeitreihe zu einer Netzzeitreihe?<BR align="left"/>>];
    "A05" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A05</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Zuordnung bereits vorhanden<BR align="left"/>Hinweis: In der Antwort ist die zugeordnete Netzzeitreihe anzugeben.<BR align="left"/></FONT>>];
    "6" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>6: </B>Ist ein nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>];
    "A99" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A99</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Ablehnung Sonstiges<BR align="left"/>Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben / benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.04.2024 00:00 Uhr<BR align="left"/></FONT>>];
    "A06" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A06</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Zuordnung durchgeführt<BR align="left"/></FONT>>];

    "Start" -> "1";
    "1" -> "A01" [label=<<B>JA</B>>, color="#7aab8a"];
    "1" -> "2" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "2" -> "A02" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "2" -> "3" [label=<<B>JA</B>>, color="#7aab8a"];
    "3" -> "A03" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "3" -> "4" [label=<<B>JA</B>>, color="#7aab8a"];
    "4" -> "A04" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "4" -> "5" [label=<<B>JA</B>>, color="#7aab8a"];
    "5" -> "A05" [label=<<B>JA</B>>, color="#7aab8a"];
    "5" -> "6" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "6" -> "A99" [label=<<B>JA</B>>, color="#7aab8a"];
    "6" -> "A06" [label=<<B>NEIN</B>>, color="#7aab8a"];

    bgcolor="transparent";
}
