FV2304/E_0102.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

title
MaBiS

7.8.1: AD: Zuordnung einer Netzgangzeitreihe zu einer Netzzeitreihe beim NB



end title
:<b>E_0102</b>;
note right
<b><i>Prüfende Rolle: NB
end note

if (<b>1: </b> Wird die ID der Netzgangzeitreihe bereits für die Identifikation eines Nicht-MaBiS-ZP verwendet?) then (ja)
    :A01;
    note left
        Cluster: Ablehnung
        ID bereits außerhalb MaBiS verwendet
    endnote
    kill;
else (nein)
endif
if (<b>2: </b> Entspricht die Zuordnung der Netzgangzeitreihe zur Netzzeitreihe der Vereinbarung zur messtechnischen Abgrenzung der beiden benachbarten NB?) then (ja)
else (nein)
    :A02;
    note left
        Cluster: Ablehnung
        Zuordnung passt nicht zur Vereinbarung
    endnote
    kill;
endif
if (<b>3: </b> Ist der Absender zum Zuordnungsbeginn an der Netzzeitreihe beteiligt?) then (ja)
else (nein)
    :A03;
    note left
        Cluster: Ablehnung
        Keine Berechtigung für die Netzzeitreihe
    endnote
    kill;
endif
if (<b>4: </b> Ist der Empfänger zum Zuordnungsbeginn an der Netzzeitreihe beteiligt?) then (ja)
else (nein)
    :A04;
    note left
        Cluster: Ablehnung
        Keine Beteiligung an der Netzzeitreihe
    endnote
    kill;
endif
if (<b>5: </b> Existiert zum Zuordnungsbeginn bereits eine Zuordnung der angegebenen Netzgangzeitreihe zu einer Netzzeitreihe?) then (ja)
    :A05;
    note left
        Cluster: Ablehnung
        Zuordnung bereits vorhanden
        Hinweis: In der Antwort ist die zugeordnete Netzzeitreihe anzugeben.
    endnote
    kill;
else (nein)
endif
if (<b>6: </b> Ist ein nicht spezifizierter Fehler aufgetreten?) then (ja)
    :A99;
    note left
        Ablehnung Sonstiges
        Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben / benennen.
        Nutzungsmöglichkeit Ende: 01.04.2024 00:00 Uhr
    endnote
    kill;
else (nein)
    :A06;
    note left
        Cluster: Zustimmung
        Zuordnung durchgeführt
    endnote
    kill;
endif

@enduml
